Revit 2026 API

# MarginType Enumeration

---

An enumerated type listing all Margin types of Print Setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MarginType
```
```vb
Public Enumeration MarginType
```
```cpp
public enum class MarginType
```
```fsharp
type MarginType
```

| Member name | Value | Description |
| --- | --- | --- |
| NoMargin | 0 | The type of Margin is No Margin. |
| PrinterLimit | 1 | The type of Margin is Printer Limit. |
| UserDefined | 2 | The type of Margin is User Defined. |

#### Reference

Autodesk.Revit.DB Namespace